Dawit-Sh/Alpha-Core/STM32F103-AlphaCore/AlphaCore/stm32f103_hal_core.h
#include "stm32f10x.h"
#include "stdbool.h"


#define MASK(Down,Up) (Down | Up << 16)
#define UPPERWORD(X) ((X & 0xFFFF0000) >> 16)
#define LOWERWORD(X) ((X & 0x0000FFFF))



#define BUS_AHB			1
#define BUS_APB1		2
#define BUS_APB2		3

#define Peripheral_AFIO  		MASK( 0,BUS_APB2)
#define Peripheral_GPIOA 		MASK( 2,BUS_APB2)
#define Peripheral_GPIOB 		MASK( 3,BUS_APB2)
#define Peripheral_GPIOC 		MASK( 4,BUS_APB2)
#define Peripheral_GPIOD 		MASK( 5,BUS_APB2)
#define Peripheral_GPIOE 		MASK( 6,BUS_APB2)
#define Peripheral_GPIOF 		MASK( 7,BUS_APB2)
#define Peripheral_GPIOG 		MASK( 8,BUS_APB2)
#define Peripheral_ADC1 		MASK( 9,BUS_APB2)
#define Peripheral_ADC2 		MASK(10,BUS_APB2)
#define Peripheral_TIM1 		MASK(11,BUS_APB2)
#define Peripheral_SPI1 		MASK(12,BUS_APB2)
#define Peripheral_TIM8 		MASK(13,BUS_APB2)
#define Peripheral_USART1 		MASK(14,BUS_APB2)
#define Peripheral_ADC3  		MASK(15,BUS_APB2)
#define Peripheral_TIM9  		MASK(19,BUS_APB2)
#define Peripheral_TIM10  		MASK(20,BUS_APB2)
#define Peripheral_TIM11  		MASK(21,BUS_APB2)

#define Peripheral_TIM2  		MASK( 0,BUS_APB1)
#define Peripheral_TIM3  		MASK( 1,BUS_APB1)
#define Peripheral_TIM4  		MASK( 2,BUS_APB1)
#define Peripheral_TIM5  		MASK( 3,BUS_APB1)
#define Peripheral_TIM6  		MASK( 4,BUS_APB1)
#define Peripheral_TIM7  		MASK( 5,BUS_APB1)
#define Peripheral_TIM12  		MASK( 6,BUS_APB1)
#define Peripheral_TIM13  		MASK( 7,BUS_APB1)
#define Peripheral_TIM14 		MASK( 8,BUS_APB1)
#define Peripheral_SPI2  		MASK(14,BUS_APB1)
#define Peripheral_SPI3  		MASK(15,BUS_APB1)
#define Peripheral_USART2  		MASK(17,BUS_APB1)
#define Peripheral_USART3  		MASK(18,BUS_APB1)
#define Peripheral_USART4  		MASK(19,BUS_APB1)
#define Peripheral_USART5  		MASK(20,BUS_APB1)
#define Peripheral_I2C1  		MASK(21,BUS_APB1)
#define Peripheral_I2C2  		MASK(22,BUS_APB1)
#define Peripheral_USB  		MASK(23,BUS_APB1)
#define Peripheral_CAN  		MASK(25,BUS_APB1)
#define Peripheral_BKP  		MASK(27,BUS_APB1)
#define Peripheral_PWR  		MASK(28,BUS_APB1)
#define Peripheral_DAC  		MASK(29,BUS_APB1)


#define GPIO_CONF_IN_ANALOG 					0
#define GPIO_CONF_IN_FLOAT						1
#define GPIO_CONF_IN_PUSHUP_PULLDOWN 			2
#define GPIO_CONF_OUT_PUSHPULL					0
#define GPIO_CONF_OUT_OPEN_DRAIN				1
#define GPIO_CONF_OUT_ALT_PUSHPULL				2
#define GPIO_CONF_OUT_ALT_OPENDRAIN				3


#define GPIO_MODE_IN							0
#define GPIO_MODE_OUT_10MHZ						1
#define GPIO_MODE_OUT_02MHZ						2
#define GPIO_MODE_OUT_50MHZ						3


void enablePeripheralClock(int peripheral);
void disablePeripheralClock(int peripheral);
void configureGPIO(int port,int pin,int mode,int configuration);


